Autodesk.Revit.DB.ParameterElement.GetDefinition
Get the definition representing this parameter element.
Returns:
The parameter.
Since:
2016

Autodesk.Revit.DB.ParameterElement
An Element that stores a user-defined parameter.
Remarks:
Revit supports both built-in and user-defined parameters.  Built-in parameters
ship with the application, and they are not stored in Revit documents.
User-defined parameters are dynamically created, and they are stored in the
documents that use them, wrapped in ParameterElement objects.  Different
subclasses of ParemeterElement represent different kinds of user-defined
parameters.
Since:
2016